{
  "header": {
    "home": "Home",
    "portfolio": "Portfolio",
    "about": "About",
    "contact": "Contact"
  },
  "portfolio": {
    "slogan1": "Summary :",
    "slogan2": "Features :",
    "slogan3": "Link or Source :",
    "slogan4": "Technology :",
    "title1": "Card Time - Card game web",
    "summary1": "This project is a standard web architecture consisting of a client (Vite & TS), CMS (Vue2), a backend API (Node.js), and a database (MongoDB). It also includes a comprehensive project plan and a web crawler. The web crawler's primary purpose is to fetch daily card prices for card price analysis. This project is a collaborative effort with a friend. Currently, the backend and backend API are mostly complete, and the client-side is in progress. We anticipate completing it by December 23rd and plan to host it on AWS.",
    "feature1": "The purpose of this project is to provide card game enthusiasts with the ability to browse articles written by other users, search for cards, and assemble card decks. Additionally, by utilizing the price data obtained through the web crawler, we aim to make card prices more transparent. Users can also apply for an account to become a blogger on this website, allowing them to write articles in the backend for other users to view.",
    "title2": "House View Log",
    "feature2": "The main goal of this project is to target users who are interested in purchasing homes. It is primarily designed for use during property viewings, allowing users to easily take notes and upload photos for sharing with other users. Users can also select specific properties on a map to view comments from other users, which can serve as one of the decision-making factors when considering a purchase. The website is currently hosted on Vercel and is fully operational. In the future, additional features will be added, such as street view browsing of properties and article comments, among others.",
    "summary2": "This project is a web application built using the Nuxt 3 framework. The backend is powered by Nitro configured within Nuxt 3 and is integrated with MongoDB as its database. Additionally, the project utilizes the Google Maps API to enhance the user experience, allowing users to use maps as an aid in searching for their desired properties.If users choose to register an account, they can leave comments and share their viewing experiences on properties.",
    "title3": "Personal website",
    "summary3": "This project is a static webpage built using Vite and Vue3 as the framework. It also incorporates three.js and cannon.js to create 3D visuals and physics-based collision effects. Additionally, a custom carousel component was handcrafted, offering different carousel effects for various screen sizes.",
    "feature3": "This webpage is my personal portfolio website, containing my personal works, my skills, interests, basic information, and how to contact me.",
    "title4": "Power tool3.0 (Company Product)",
    "feature4": "This software serves as the primary tool for our current company product, the scanner. It facilitates tasks such as pairing, parameter configuration, updates, and more. Users can generate barcodes for direct scanner scanning or produce a Word/PDF document containing the generated barcodes and corresponding settings for customer use. This functionality significantly expedites the time-consuming process of configuring parameters for multiple scanners",
    "summary4": "This project is a desktop application developed using Vue3 in conjunction with Electron.js. Communication with the scanner is facilitated through Serialport.js, employing a communication method similar to WebSocket. Changes in parameters are then processed using bwp.js to generate barcodes",
    "title5": "CMS(Company)",
    "feature5": "This encompasses all parameters of the current company's internal product, including hardware and software-related documents and files, as well as the Content Management System for the customer base. The system incorporates hierarchical permissions (e.g., CRUD and download permissions for various databases), sensitive data filtering (e.g., specific permissions required to view certain fields), operation logging, and functionalities such as batch modification/addition.",
    "summary5": "This project comprises a comprehensive architecture, with the management interface developed using Vite/Vue3 in conjunction with Element Plus and Tailwind CSS. The backend is built on Node.js Express, utilizing both MySQL and MongoDB databases. The website is hosted on the company's server, running through Nginx, and is secured with SSL certificates."
  },
  "about": {
    "information": "Info.",
    "interest": "hob.",
    "experience": "Exp.",
    "technology": "Tech.",
    "job": "Job",
    "name": "Eric Hong",
    "sex": "Sex",
    "setContent": "Male",
    "birthday": "Birthday",
    "birthdayContent": "1990-03-27",
    "abode": "Abode",
    "abodeContent": "New Taipei City / Banqiao",
    "military": "Military Service",
    "militaryContent": "Discharged",
    "work": "Working Status",
    "workContent": "◆ On the job (Full time)",
    "hob1": "◆ Badminton",
    "hob2": "◆ Cycling",
    "hob3": "◆ Trading Card Game",
    "hob4": "◆ Movie",
    "hob5": "◆ Traveling",
    "exp1": "■ NCU Earth Science (2010/09 - 2014/07)",
    "exp2": "■ NCU Applied Geology (2014/09 - 2016/07)",
    "exp3": "■ Apollo Tech. Env Engineer (2017/03 - 2018/02)",
    "exp4": "■ Sinotech Env.  Project Manager (2018/04 - 2020/01)",
    "exp5": "■ III Front-End Class (2020/01-2020/07)",
    "exp6": "■ Cino Group Front-End Developer (2020/08-2022/01)",
    "exp7": "■ Cino Group Full-Stack Engineer (2022/01-now)",
    "techTitle1": " Main",
    "main1": "-HTML / CSS / Javascript",
    "main2": "-Vue2 / Vue3",
    "main3": "-Vite",
    "main4": "-Nuxt3",
    "main5": "-Node.js Express",
    "main6": "-Non-SQL (MongoDB)",
    "main7": "-Three.js",
    "techTitle2": " Improvement",
    "improve1": "-About Web Accessibility",
    "improve2": "-User Experience",
    "improve3": "-React",
    "improve4": "-Docker",
    "improve5": "-Typescript",
    "improve6": "-SQL",
    "jobT1": "Power tool3.0",
    "jobC1": "<p>Electron.js / Vue3 / Serialport.js.<a href='https://www.cino.com.tw/assets/software/PowerTool/FUZZYSCAN POWERTOOL3.0-v1.0.5.zip'>(Link)</a></p>",
    "jobT2": "ConnectWizard",
    "jobC2": "<p>Electron.js / Vue3 / Serialport.js.<a href='https://www.cino.com.tw/assets/software/ConnectWizard/FuzzyScan ConnectWizard_Windows_1.0.06.zip'>(Link)</a></p>",
    "jobT3": "Motion Tolerance Tool",
    "jobC3": "Electron.js / Vue3 / Vite / Tailwind css",
    "jobT4": "Parameter data and company documents CMS ",
    "jobC4": "Vue3 / Vite / Typescript / MongoDB / Node.js Express / Tailwind css"
  },
  "copyright": {
    "desc": "Copyright © 2023 Eric Hong. All rights reserved."
  },
  "home": {
    "slogan1": "While there is life",
    "slogan2": "there is hope.",
    "source": "- The Theory of Everything -"
  },
  "connect": {
    "phone": "Phone :",
    "email": "Email :",
    "address": "Address :",
    "addressC": "New Taipei City, Taiwan",
    "cv": "CV :",
    "cvC": "Click Me"
  }
}
